# 04 - Grouping

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.

In [3]:
regiment = pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [11]:
regiment[regiment['regiment'] == 'Nighthawks']['preTestScore'].mean()

15.25


### Step 5. Present general statistics by company

In [15]:
regiment.groupby("company").agg({sum, max, min, 'mean', 'median', 'std'})

        preTestScore                               postTestScore              \
                mean median sum max min        std          mean median  sum
company
1st         6.666667    3.5  40  24   2   8.524475     57.666667     66  346
2nd        15.500000   13.5  93  31   2  14.652645     67.000000     62  402


        max min        std
company
1st      94  25  27.485754
2nd      94  57  14.057027

### Step 6. What is the mean of each company's preTestScore?

In [ ]:
regiment[regiment['regiment'] == 'Nighthawks']['preTestScore'].mean()

### Step 7. Present the mean preTestScores grouped by regiment and company

In [16]:
regiment.groupby(['regiment', 'company']).agg({'preTestScore' : 'mean'})

                    preTestScore
regiment   company
Dragoons   1st               3.5
           2nd              27.5
Nighthawks 1st              14.0
           2nd              16.5
Scouts     1st               2.5
           2nd               2.5

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [20]:
regiment.pivot_table(index = 'regiment', columns = 'company')['preTestScore']

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Step 9. Group the entire dataframe by regiment and company

In [21]:
regiment.groupby(['regiment', 'company'])

### Step 10. What is the number of observations in each regiment and company

In [25]:
regiment.groupby(['regiment', 'company']).count()["name"]

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
Name: name, dtype: int64

In [23]:
len(regiment)

12

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [30]:
regiment_groups = regiment.groupby('regiment')
for i in regiment_groups:
    print(i)
    print('-' * 100)

('Dragoons',    regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57)
----------------------------------------------------------------------------------------------------
('Nighthawks',      regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62)
----------------------------------------------------------------------------------------------------
('Scouts',    regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70)
----------------------------------------------------------------------------------------------------